In [1]:
%load_ext sql

In [2]:
%sql sqlite:///nueva.sqlite

In [3]:
%%sql

CREATE TABLE alumnos (id INTEGER NOT NULL, 
                      nombre VARCHAR(50) NOT NULL, 
                      fecha_de_ingreso DATE NOT NULL);

 * sqlite:///nueva.sqlite
Done.

[]

In [4]:
%%sql 

INSERT INTO alumnos 
(id, nombre, fecha_de_ingreso, id_examenes)
VALUES
(1, "Xavier", "2023-02-04"),
(2, "Ana", "2023-01-15"),
(3, "Rodrigo", "2023-02-02"),
(4, "Susana", "2023-01-01"),
(5, "Jose", "2023-02-01"),
(6, "Luis", "2023-02-01"),
(7, "Omar", "2023-02-01");

 * sqlite:///nueva.sqlite
7 rows affected.

[]

In [5]:
%sql SELECT * FROM alumnos;

 * sqlite:///nueva.sqlite
Done.

[(1, 'Xavier', '2023-02-04'),
 (2, 'Ana', '2023-01-15'),
 (3, 'Rodrigo', '2023-02-02'),
 (4, 'Susana', '2023-01-01'),
 (5, 'Jose', '2023-02-01'),
 (6, 'Luis', '2023-02-01'),
 (7, 'Omar', '2023-02-01')]

In [6]:
%%sql

CREATE TABLE examenes (id INTEGER NOT NULL, 
                      clase VARCHAR(30) DEFAULT "SQL",
                      puntaje INTEGER,
                      id_alumno INTEGER REFERENCES alumnos(id));

 * sqlite:///nueva.sqlite
Done.

[]

In [7]:
%%sql

INSERT INTO examenes
(id, clase, puntaje, id_alumno)
VALUES
(1, "SQL", 8, 6),
(2, "Python", 4, 3),
(3, "SQL", 9, 7),
(4, "HTML", 7, 1),
(5, "SQL", 8, 2),
(6, "SQL", 9, 4),
(7, "Python", 10, 5),
(8, "SQL", 8, 6),
(9, "Python", 8, 3),
(10, "SQL", 5, 7),
(11, "HTML", 8, 1),
(12, "SQL", 7, 2),
(13, "SQL", 10, 4);

 * sqlite:///nueva.sqlite
13 rows affected.

[]

In [8]:
%sql SELECT * FROM examenes;

 * sqlite:///nueva.sqlite
Done.

[(1, 'SQL', 8, 6),
 (2, 'Python', 4, 3),
 (3, 'SQL', 9, 7),
 (4, 'HTML', 7, 1),
 (5, 'SQL', 8, 2),
 (6, 'SQL', 9, 4),
 (7, 'Python', 10, 5),
 (8, 'SQL', 8, 6),
 (9, 'Python', 8, 3),
 (10, 'SQL', 5, 7),
 (11, 'HTML', 8, 1),
 (12, 'SQL', 7, 2),
 (13, 'SQL', 10, 4)]

In [9]:
%sql SELECT * from examenes WHERE id_alumno = 4;

 * sqlite:///nueva.sqlite
Done.

[(6, 'SQL', 9, 4), (13, 'SQL', 10, 4)]

In [10]:
%%sql

CREATE TABLE clases (id INTEGER NOT NULL,
                     nombre VARCHAR(50) NOT NULL);


CREATE TABLE profesores (id INTEGER NOT NULL, 
                         nombre VARCHAR(50) NOT NULL, 
                         id_clase INTEGER REFERENCES clases(id));

 * sqlite:///nueva.sqlite
Done.
Done.

[]

In [11]:
%%sql

INSERT INTO clases
(id, nombre)
VALUES
(1, "SQL"),
(2, "Python"),
(3, "HTML"),
(4, "JavaScript");

INSERT INTO profesores
(id, nombre, id_clase)
VALUES
(1, "Jirafales", 2),
(2, "Maestro Roshi", 3),
(3, "Sarmiento", 1);

 * sqlite:///nueva.sqlite
3 rows affected.
3 rows affected.

[]

In [12]:
%sql SELECT * FROM profesores;

 * sqlite:///nueva.sqlite
Done.

[(1, 'Jirafales', 2), (2, 'Maestro Roshi', 3), (3, 'Sarmiento', 1)]

In [13]:
%sql SELECT * FROM clases;

 * sqlite:///nueva.sqlite
Done.

[(1, 'SQL'), (2, 'Python'), (3, 'HTML')]

In [16]:
%%sql

CREATE TABLE alumnos_cursando (id INTEGER NOT NULL, 
                               id_alumno INTEGER REFERENCES alumnos(id), 
                               id_clase INTEGER REFERENCES clases(id));

 * sqlite:///nueva.sqlite
Done.

[]

In [17]:
%%sql

INSERT INTO alumnos_cursando
(id, id_alumno, id_clase)
VALUES
(1, 1, 1),
(2, 1, 3),
(3, 2, 1),
(4, 3, 2),
(5, 3, 3),
(6, 4, 2);

 * sqlite:///nueva.sqlite
6 rows affected.

[]

In [18]:
%sql SELECT * FROM alumnos_cursando;

 * sqlite:///nueva.sqlite
Done.

[(1, 1, 1), (2, 1, 3), (3, 2, 1), (4, 3, 2), (5, 3, 3), (6, 4, 2)]

In [ ]:
#%sql DROP TABLE alumnos;
#%sql DROP TABLE examenes;
#%sql DROP TABLE clases;
#%sql DROP TABLE profesores;